In [34]:
import pandas as pd

In [35]:
#initialize list of list
dat = [['Ayo', 10], ['Imran', 15],['Chucks', 14]]
data2 = {'Name': ['Ayo', 'Imran', 'Chucks'], 'Age': [10,15,14], 'Capital': ['Umuahia', 'Yola', 'PortHarcourt']}

#create the pandas DataFrame from the list and adding column header
df = pd.DataFrame(dat, columns = ['Name', 'Age'])
df2 = pd.DataFrame(data2)
df
df2

     Name  Age       Capital
0     Ayo   10       Umuahia
1   Imran   15          Yola
2  Chucks   14  PortHarcourt

In [10]:
df2.dtypes

Name       object
Age         int64
Capital    object
dtype: object

In [36]:
#Create thee pandas DaataFrame from the dictionary of narray list
df2.info

<bound method DataFrame.info of      Name  Age       Capital
0     Ayo   10       Umuahia
1   Imran   15          Yola
2  Chucks   14  PortHarcourt>

In [15]:
# Pandas DataFrame from lists using zip.
#list1
Name = ['Ayo', 'Imran', 'Chucks', 'Judith']

#List2
Age =  [25, 30, 26, 22]

# get the list of tuples from 2 lists and merge them by using zip()

lis_of_tuples = list(zip(Name,Age))

df3 = pd.DataFrame(lis_of_tuples, columns = ['Name', 'Age'])
df3

     Name  Age
0     Ayo   25
1   Imran   30
2  Chucks   26
3  Judith   22

In [37]:
# import csv data then view as Pandas of the Data set
csv_df =pd.read_csv("C:/Users/henry/OneDrive/Desktop/DSN2006.csv")
csv_df.head()

            STATES  AREA (km2)   Population
0       Abia State         6320     2845380
1    Adamawa State        36917     3178950
2  Akwa Ibom State         7081     3178950
3    Anambra State         4844     4177828
4     Bauchi State        45837     4653066

In [28]:
csv_df.describe(include = 'all')

            STATES   AREA (km2)     Population
count           37     37.000000  3.700000e+01
unique          37           NaN           NaN
top     Abia State           NaN           NaN
freq             1           NaN           NaN
mean           NaN  24990.864865  3.775879e+06
std            NaN  18243.870444  1.726418e+06
min            NaN   3345.000000  1.405201e+06
25%            NaN   9251.000000  2.845380e+06
50%            NaN  20156.000000  3.314043e+06
75%            NaN  36800.000000  4.177828e+06
max            NaN  76363.000000  9.401288e+06

In [33]:
csv_df['Population']

0     2845380
1     3178950
2     3178950
3     4177828
4     4653066
5     1704515
6     4253641
7     4171104
8     2892988
9     4112445
10    2176947
11    3233366
12    2398957
13    3267837
14    1405201
15    2365040
16    3927563
17    4361002
18    6113503
19    9401288
20    5801584
21    3256541
22    3314043
23    2365353
24    9113605
25    1869377
26    3954772
27    3751140
28    3460877
29    3416959
30    5580894
31    3206531
32    5198605
33    3702676
34    2294800
35    2321339
36    3278873
Name: Population, dtype: int64